# 데이터프레임 합성

In [1]:
import numpy as np
import pandas as pd

# merge 함수

In [2]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [3]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [4]:
# Inner join
pd.merge(df1, df2)         # how = 'inner'

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [5]:
# Left outer join
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [6]:
# Right outer join
pd.merge(df1, df2, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리   30000
3  1005   희동   15000
4  1006  마이콜    5000
5  1008  NaN  100000

In [7]:
# full outer join
pd.merge(df1, df1, how="outer")

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

## 동일한 컬럼명이 여러개인 경우

In [13]:
df1 = pd.DataFrame({
      '고객명': ['춘향, 춘향, 몽룡'],
      '날짜': ['2018-01-01, 2018-01-02, 2018-01-01'],
      '데이터': ['20000, 30000, 10000']})
df1

          고객명                                  날짜                  데이터
0  춘향, 춘향, 몽룡  2018-01-01, 2018-01-02, 2018-01-01  20000, 30000, 10000

In [14]:
df2 = pd.DataFrame({
    '고객명': ['춘향, 몽룡'],
    '데이터': ['여자, 남자']})
df2

      고객명     데이터
0  춘향, 몽룡  여자, 남자

In [15]:
pd.merge(df1, df2, on ='고객명')

Empty DataFrame
Columns: [고객명, 날짜, 데이터_x, 데이터_y]
Index: []

## 동일한 컬럼명이 없는 경우

In [28]:
df1 = pd.DataFrame({
    '이름': ['영희, 철수, 철수'],
    '성적': ['1, 2, 3']})
df1

           이름       성적
0  영희, 철수, 철수  1, 2, 3

In [26]:
df2 = pd.DataFrame({
      '성명': ['영희, 영희, 철수'],
      '성적2': ['4, 5, 6']})
df2

           성명      성적2
0  영희, 영희, 철수  4, 5, 6

In [32]:
pd.merge(df1, df2, left_on = '이름', right_on = '성명')

Empty DataFrame
Columns: [이름, 성적, 성명, 성적2]
Index: []

## join 메서드

In [41]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1.set_index('고객번호', inplace=True)
df1

       이름
고객번호
1001   둘리
1002  도우너
1003   또치
1004   길동
1005   희동
1006  마이콜
1007   영희

In [44]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2.set_index('고객번호', inplace=True)
df2

          금액
고객번호
1001   10000
1001   20000
1005   15000
1006    5000
1008  100000
1001   30000

In [46]:
df1.join(df2)           # Left outer join

       이름       금액
고객번호
1001   둘리  10000.0
1001   둘리  20000.0
1001   둘리  30000.0
1002  도우너      NaN
1003   또치      NaN
1004   길동      NaN
1005   희동  15000.0
1006  마이콜   5000.0
1007   영희      NaN

## concat 함수

In [47]:
s1 = pd.Series([0,1], index=['A','B'])

In [51]:
s2 = pd.Series([2,3,4], index=['A','B','C'])
s2

A    2
B    3
C    4
dtype: int64

In [52]:
pd.concat([s1, s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [56]:
df1 = pd.DataFrame(
      np.arange(6).reshape(3, 2),
      index=['a', 'b', 'c'],
      columns = ['데이터1', '데이터2'])
df1

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [58]:
df2 = pd.DataFrame(
    5 + np.arange(4).reshape(2, 2),
    index = ['a', 'c'],
    columns = ['데이터3', '데이터4'])
df2

   데이터3  데이터4
a     5     6
c     7     8

In [59]:
pd.concat([df1, df2], axis=1)

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

### 연습문제

In [60]:
df1 = pd.DataFrame(np.random.randint(100, 1000, size=(6,2)),
                   columns=['매출','비용'],
                   index=['1월','2월','3월','4월','5월','6월'])
df1['이익'] = df1.매출 - df1.비용
df1

     매출   비용   이익
1월  738  396  342
2월  260  174   86
3월  648  361  287
4월  317  348  -31
5월  743  747   -4
6월  820  134  686

In [69]:
df2 = pd.DataFrame(np.random.randint(100, 1000, size=(6,2)),
                   columns=['매출','비용'],
                   index=['7월','8월','9월','10월','11월','12월'])
df2['이익'] = df2.매출 - df2.비용
df2

      매출   비용   이익
7월   614  201  413
8월   654  644   10
9월   460  254  206
10월  375  357   18
11월  661  804 -143
12월  923  960  -37

In [70]:
df = pd.concat([df1, df2])
df

      매출   비용   이익
1월   738  396  342
2월   260  174   86
3월   648  361  287
4월   317  348  -31
5월   743  747   -4
6월   820  134  686
7월   614  201  413
8월   654  644   10
9월   460  254  206
10월  375  357   18
11월  661  804 -143
12월  923  960  -37

In [71]:
tdf = pd.DataFrame(df.sum()).T
tdf

     매출    비용    이익
0  7213  5380  1833

In [72]:
tdf.index = ['합계']
tdf

      매출    비용    이익
합계  7213  5380  1833

In [73]:
df = pd.concat([df, tdf])
df

       매출    비용    이익
1월    738   396   342
2월    260   174    86
3월    648   361   287
4월    317   348   -31
5월    743   747    -4
6월    820   134   686
7월    614   201   413
8월    654   644    10
9월    460   254   206
10월   375   357    18
11월   661   804  -143
12월   923   960   -37
합계   7213  5380  1833